
/* Presented when a URL cannot be loaded because its scheme isn't understood */
"Don't know how to load URL %@" = "عدم معرفة كيفية تحميل عنوان URL %@";

/* Presented when an HTTP URL cannot establish a connection with a particular host */
"Could not connect to host %@" = "تعذر الاتصال بالمضيف %@";

/* Presented when a response from an HTTP server comes back with a bad format */
"Bad header received from server" = "تم تلقي عنوان غير صالح من الخادم";

/* Presented when a description of a particular host can't be determined. */
"Can't determine IP address of host: %@" = "لا يمكن تحديد عنوان IP الخاص بالمضيف: %@";

/* Presented when the host description was found, but a particular port couldn't be opened. */
"Can't get a description of port %d" = "لا يمكن الحصول على وصف للمنفذ %d";

/* Presented when a particular host cannot be contacted via the given port */
"Can't connect to host %@ using port %d" = "لا يمكن الاتصال بالمضيف %@ باستخدام المنفذ %d";

/* Presented when an HTTP server comes back with an unknown status code */
"Received unknown HTTP server response %@: %@" = "تم تلقي استجابة %@ لخادم HTTP غير معروفة: %@";

/* Presented when an HTTP server returns a failure code */
"HTTP request failed for URL %@:%@" = "فشل طلب HTTP لعنوان URL %@:%@";

/* Presented when the connection to an HTTP server is unexpectedly lost */
"Lost connection to host %@" = "تم فقد الاتصال بالمضيف %@";

/* Presented when a file can not be opened for reading (file may not exist) */
"Could not read from %@" = "تعذرت القراءة من %@";

/* Presented when a redirection loop has been detected */
"Detected a redirection loop while attempting to load URL %@" = "تم اكتشاف حلقة تكرارية في إعادة التوجيه أثناء محاولة تحميل عنوان URL %@";

/* Presented when an FTP server hangs up or becomes otherwise unavailable */
"Service unavailable for host %@" = "الخدمة غير متوفرة للمضيف %@";

/* Presented when the data transfer socket cannot be created for an FTP transfer */
"Couldn't open data connection for URL path: %@" = "تعذر فتح اتصال البيانات لمسار عنوان URL: %@";

/* Presented when the indicated URL does not locate ane existing object on the server */
"Object not available for specified URL: %@" = "لا يتوفر الكائن لعنوان URL المحدد: %@";

/* Presented when the FTP server doesn't recognize a particular command */
"FTP command not recognized by host: %@" = "لم يتم التعرف على أمر FTP من قِبل المضيف: %@";

/* Presented when the FTP server rejects an authentication */
"User login or password not recognized." = "لم يتم التعرف على اسم دخول المستخدم أو كلمة السر.";

/* Format used to display sizes 100 GB or greater */
"%.0f GB" = "%.0f غ.ب.";

/* Format used to display sizes between 100 and 999 KB */
"%.0f KB" = "%.0f ك.ب.";

/* Format used to display sizes between 100 and 999 MB */
"%.0f MB" = "%.0f م.ب.";

/* Format used to display a size between 2 and 100 bytes */
"%.0f bytes" = "%.0f بايت";

/* Format used to display sizes between 1000 MB and 9.9 GB */
"%.1f GB (1.0)" = "%.1f غ.ب.";

/* Format used to display sizes between 10 and 99.9 GB */
"%.1f GB (10.0)" = "%.1f غ.ب.";

/* Format used to display sizes between 100 and 999 bytes */
"%.1f KB (0.1)" = "%.1f ك.ب.";

/* Format used to display sizes between 1000 bytes and 9.9 KB */
"%.1f KB (1.0)" = "%.1f ك.ب.";

/* Format used to display sizes between 10 and 99.9 KB */
"%.1f KB (10.0)" = "%.1f ك.ب.";

/* Format used to display sizes between 1000 KB and 9.9 MB */
"%.1f MB (1.0)" = "%.1f م.ب.";

/* Format used to display sizes between 10 and 99.9 MB */
"%.1f MB (10.0)" = "%.1f م.ب.";

/* Format string for label of a saved password in Keychain: URL (USERNAME) */
"%@ (%@)" = "%@ (%@)";

/* Format used to partial byte count along with total */
"%@ of %@" = "%@ من %@";

/* String used for showing a zero byte size */
"0 bytes" = "٠ بايت";

/* String used for showing a one byte size */
"1 byte" = "بايت واحد";

/* Kind string used for keychain items from forms-based logins */
"Web form password" = "كلمة سر نموذج الويب";

/* HTTP result code string */
"accepted" = "مقبول";

/* HTTP result code string */
"bad gateway" = "عبّارة غير صالحة";

/* HTTP result code string */
"bad request" = "طلب غير صالح";

/* HTTP result code string */
"client error" = "خطأ في العميل";

/* HTTP result code string */
"conflict" = "تعارض";

/* HTTP result code string */
"continue" = "متابعة";

/* HTTP result code string */
"created" = "تم الإنشاء";

/* HTTP result code string */
"expectation failed" = "فشل التوقع";

/* HTTP result code string */
"forbidden" = "ممنوع";

/* HTTP result code string */
"found" = "تم العثور عليه";

/* HTTP result code string */
"gateway timed out" = "انتهت مهلة العبّارة";

/* HTTP result code string */
"informational" = "معلوماتي";

/* HTTP result code string */
"internal server error" = "خطأ خادم داخلي";

/* HTTP result code string */
"length required" = "الطول مطلوب";

/* HTTP result code string */
"method not allowed" = "الطريقة غير مسموح بها";

/* HTTP result code string */
"moved permanently" = "تم النقل نهائيًا";

/* HTTP result code string */
"multiple choices" = "اختيارات متعددة";

/* HTTP result code string */
"needs proxy" = "بحاجة لمُلقم";

/* HTTP result code string */
"no content" = "بلا محتوى";

/* HTTP result code string */
"no error" = "لا يوجد خطأ";

/* HTTP result code string */
"no longer exists" = "لم يعد موجودًا";

/* HTTP result code string */
"non-authoritative information" = "معلومات غير مخوّل بها";

/* HTTP result code string */
"not found" = "غير موجود";

/* HTTP result code string */
"not modified" = "غير معدّلة";

/* HTTP result code string */
"partial content" = "محتوى جزئي";

/* HTTP result code string */
"payment required" = "يلزم الدفع";

/* HTTP result code string */
"precondition failed" = "فشل الشرط المسبق";

/* HTTP result code string */
"proxy authentication required" = "مصادقة المُلقم مطلوبة";

/* HTTP result code string */
"redirected" = "تمت إعادة التوجيه";

/* HTTP result code string */
"request timed out" = "انتهت مهلة الطلب";

/* HTTP result code string */
"request too large" = "حجم الطلب كبير جدًا";

/* HTTP result code string */
"requested URL too long" = "الـ URL المطلوب طويل جدًا";

/* HTTP result code string */
"requested range not satisfiable" = "النطاق المطلوب غير مرضي";

/* HTTP result code string */
"reset content" = "إعادة تعيين المحتوى";

/* HTTP result code string */
"see other" = "أخرى";

/* HTTP result code string */
"server error" = "خطأ في الخادم";

/* HTTP result code string */
"service unavailable" = "الخدمة غير متوفرة";

/* HTTP result code string */
"success" = "نجاح";

/* HTTP result code string */
"switching protocols" = "تبديل البروتوكولات";

/* HTTP result code string */
"temporarily redirected" = "تمت إعادة التوجيه مؤقتًا";

/* HTTP result code string */
"unacceptable" = "غير مقبول";

/* HTTP result code string */
"unauthorized" = "غير مصرّح به";

/* HTTP result code string */
"unimplemented" = "غير مطبّق";

/* Unknown filename */
"unknown" = "غير معروف";

/* HTTP result code string */
"unsupported media type" = "نوع وسائط غير مدعوم";

/* HTTP result code string */
"unsupported version" = "إصدار غير مدعوم";
